consultaSim/app/views/consulta/_form.html.erb

SELECT "pacientes".* FROM "pacientes"
---
    <%= form.label :Paciente_id, style: "display: block" %>
    <%= form.collection_select(:Paciente_id, Paciente.all, :id, :nomeCompleto, include_blank: "Escolha um paciente ")%>

SELECT "medicos".* FROM "medicos"
---
    <%= form.label :Medico_id, style: "display: block" %>
    <%= form.collection_select(:Medico_id, Medico.all, :id, :nomeCompleto, include_blank: "Escolha um medico ")%>